public class Main {
    public static void main(String[] args) {


    }

    static void task1(){
        /*
        Реализуйте структуру телефонной книги с помощью HashMap, учитывая, что 1 человек может иметь несколько телефонов
         */
    }

    static void task2(){
        /*
        Пусть дан список сотрудников:

        Иван Иванов, Светлана Петрова, Кристина Белова, Анна Мусина, Анна Крутова, Иван Юрин, Петр Лыков,
        Павел Чернов, Петр Чернышов, Мария Федорова, Марина Светлова, Мария Савина, Мария Рыкова,
        Марина Лугова, Анна Владимирова, Иван Мечников, Петр Петин, Иван Ежов.

        Написать программу, которая найдет и выведет повторяющиеся имена с количеством повторений.
        Отсортировать по убыванию популярности. Для сортировки использовать TreeMap.
         */
    }

    static void task3(){
        /*
        Реализовать алгоритм пирамидальной сортировки (HeapSort)
         */
    }

    static void task4() {
        /*
        На шахматной доске расставить 8 ферзей так, чтобы они не били друг друга.
         */
    }
}