import java.util.Scanner;



public class Main {
    public static void main(String[] args) {
    }
    public static void task1(){
        /*
        Вычислить n-ое треугольного число(сумма чисел от 1 до n)
         */
        System.out.println("Приветствую! Программа выводит в консоль сумму чисел от 1 до n, где n вводите вы. ");
        Scanner scanner = new Scanner(System.in);
        Integer num = scanner.nextInt();
        System.out.println(num);




    }
    public static void task2(){
        /*
        Вычислить n! (произведение чисел от 1 до n)
         */





    }
    public static void task3(){
        /*
        Вывести все простые числа от 1 до 1000 (простые числа - это числа которые делятся только на себя и на единицу
        без остатка. Чтобы найти остаток от деления используйте оператор % , например 10%3 будет равно единице)
         */





    }
    public static void task4(){
        /*
        Реализовать простой калькулятор ("введите первое число"... "Введите второе число"... "укажите операцию,
        которую надо выполнить с этими числами"... "ответ: ...")
         */





    }
    public static void task5(){
        /*
        Задано уравнение вида q + w = e, q, w, e >= 0. Некоторые цифры могут быть заменены знаком вопроса,
        например 2? + ?5 = 69. Требуется восстановить выражение до верного равенства. Предложить хотя бы одно решение
        или сообщить, что его нет.
         */





    }
}